In [77]:
import pandas as pd

In [78]:
# load in data
school_data_path = "resources/schools_complete.csv"
student_data_path = "resources/students_complete.csv"

# read data as a dataframe
school_df = pd.read_csv(school_data_path)
student_df = pd.read_csv(student_data_path)

In [79]:
# look for missing values: count values in each column
student_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [80]:
# look for missing values: sum the count of of null values
student_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [81]:
# look for missing values: sum the count of non-null values
student_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [82]:
# check data types
school_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [83]:
# list of all prefixes and suffixes to remove from names
presuf = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [84]:
# replace pre/suffixes with an empty space
for word in presuf:
    student_df["student_name"] = student_df["student_name"].str.replace(word,"")

student_df.head(10)

/var/folders/sl/tgxsvd7x1sgfd5nbn3xfjc4m0000gn/T/ipykernel_49852/1146839763.py:3: FutureWarning: The default value of regex will change from True to False in a future version.
  student_df["student_name"] = student_df["student_name"].str.replace(word,"")

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
7,7,Nicole Baker,F,12th,Huang High School,96,69
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84

In [85]:
# merge dataframes into a single data set
full_df = pd.merge(student_df, school_df, on = "school_name")

In [86]:
full_df.head(10)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
7,7,Nicole Baker,F,12th,Huang High School,96,69,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [87]:
# get the total number of students
student_count = full_df["Student ID"].count()
student_count

39170

In [88]:
# get the number of schools
school_count = len(full_df["school_name"].unique())
school_count

15

In [89]:
# calculate the total budget
total_budget = school_df["budget"].sum()
total_budget

24649428

In [90]:
# calculate the average reading score per student
avg_reading_score = full_df["reading_score"].mean()
avg_reading_score

81.87784018381414

In [91]:
# calculate the average math score per student
avg_math_score = full_df["math_score"].mean()
avg_math_score

78.98537145774827

In [92]:
# identify all the students with passing math and reading scores
passed_math = full_df["math_score"] >= 70
passed_reading = full_df["reading_score"] >= 70

passed_math

0         True
1        False
2        False
3        False
4         True
         ...
39165     True
39166     True
39167     True
39168     True
39169     True
Name: math_score, Length: 39170, dtype: bool

In [93]:
# new dataframe of all students who passed math
passed_math = full_df[full_df["math_score"] >= 70]
passed_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [94]:
# new dataframe of all students who passed reading
passed_reading = full_df[full_df["reading_score"] >= 70]
passed_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [95]:
# count how many students passed math and reading
passed_math_count = passed_math["student_name"].count()
passed_reading_count = passed_reading["student_name"].count()

print(passed_math_count)
print(passed_reading_count)

29370
33610

In [96]:
# calculate percentages of students who passed math and reading

passed_math_pct = passed_math_count / student_count * 100
passed_reading_pct = passed_reading_count / student_count * 100

print(passed_math_pct)
print(passed_reading_pct)

74.9808526933878
85.80546336482001

In [97]:
# calculate percentage of students who passed both math and reading
passed_both = full_df[(full_df["math_score"] >= 70) & (full_df["reading_score"] >= 70)]

passed_both_count = passed_both["student_name"].count()

passed_both_pct = passed_both_count / student_count * 100
passed_both_pct

65.17232575950983

In [125]:
# new dataframe with summary values
district_df = pd.DataFrame(
    [{"Total Schools" : school_count,
     "Total Students" : student_count,
     "Total Budget" : total_budget,
     "Average Math Score" : avg_math_score,
     "Average Reading Score" : avg_reading_score,
     "% Passing Math" : passed_math_pct,
     "% Passing Reading" : passed_reading_pct,
     "% Overall Passing" : passed_both_pct}])

district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [126]:
# format columns

district_df["Total Students"] = district_df["Total Students"].map("{:,}".format)

district_df["Total Budget"] = district_df["Total Budget"].map("${:,.2f}".format)

district_df["Average Math Score"] = district_df["Average Math Score"].map("{:.1f}".format)

district_df["Average Reading Score"] = district_df["Average Reading Score"].map("{:.1f}".format)

district_df["% Passing Math"] = district_df["% Passing Math"].map("{:.0f}".format)

district_df["% Passing Reading"] = district_df["% Passing Reading"].map("{:.0f}".format)

district_df["% Overall Passing"] = district_df["% Overall Passing"].map("{:.0f}".format)

In [127]:
district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [129]:
# reorder columns
new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", 
                    "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

district_df = district_df[new_column_order]
district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65